#### Terraform Plan - Prod
`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.cloud_function.data.archive_file.function_source: Reading...
module.cloud_function.data.archive_file.function_source: Read complete after 0s [id=87c066ae666a1f90ad97723bb8f92b85bca6bfa2]
module.service_accounts.google_iam_workload_identity_pool.github: Refreshing state... [id=projects/iac-serverless/locations/global/workloadIdentityPools/prod-github-pool-v2]
module.secret_manager.google_secret_manager_secret.secret: Refreshing state... [id=projects/iac-serverless/secrets/iac-prod-app-secret]
module.service_accounts.google_service_account.function: Refreshing state... [id=projects/iac-serverless/serviceAccounts/iac-prod-function-sa@iac-serverless.iam.gserviceaccount.com]
module.networking.google_compute_network.vpc: Refreshing state... [id=projects/iac-serverless/global/networks/iac-prod-vpc]
module.service_accounts.google_service_account.terraform: Refreshing state... [id=projects/iac-serverless/serviceAccounts/prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.app_storage.google_storage_bucket.bucket: Refreshing state... [id=iac-serverless-app-data-prod]
module.deployment_storage.google_storage_bucket.bucket: Refreshing state... [id=iac-serverless-function-deploy-prod]
module.networking.google_compute_firewall.allow_internal_https: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-allow-internal-https]
module.networking.google_compute_firewall.allow_internal_icmp: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-allow-internal-icmp]
module.networking.google_compute_subnetwork.main: Refreshing state... [id=projects/iac-serverless/regions/europe-west1/subnetworks/iac-prod-vpc-main-europe-west1]
module.networking.google_compute_router.router: Refreshing state... [id=projects/iac-serverless/regions/europe-west1/routers/iac-prod-vpc-router]
module.networking.google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-allow-health-checks]
module.networking.google_compute_subnetwork.connector: Refreshing state... [id=projects/iac-serverless/regions/europe-west1/subnetworks/iac-prod-vpc-connector-europe-west1]
module.networking.google_compute_firewall.allow_https_egress: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-allow-https-egress]
module.networking.google_compute_firewall.deny_all_ingress: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-deny-all-ingress]
module.networking.google_compute_firewall.deny_all_egress: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-deny-all-egress]
module.networking.google_compute_firewall.allow_dns_egress: Refreshing state... [id=projects/iac-serverless/global/firewalls/iac-prod-vpc-allow-dns-egress]
module.service_accounts.google_project_iam_member.terraform_roles["roles/compute.securityAdmin"]: Refreshing state... [id=iac-serverless/roles/compute.securityAdmin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/secretmanager.admin"]: Refreshing state... [id=iac-serverless/roles/secretmanager.admin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/cloudfunctions.admin"]: Refreshing state... [id=iac-serverless/roles/cloudfunctions.admin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/run.admin"]: Refreshing state... [id=iac-serverless/roles/run.admin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/storage.admin"]: Refreshing state... [id=iac-serverless/roles/storage.admin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=iac-serverless/roles/iam.serviceAccountUser/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/compute.loadBalancerAdmin"]: Refreshing state... [id=iac-serverless/roles/compute.loadBalancerAdmin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=iac-serverless/roles/iam.serviceAccountAdmin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/compute.networkAdmin"]: Refreshing state... [id=iac-serverless/roles/compute.networkAdmin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.terraform_roles["roles/vpcaccess.admin"]: Refreshing state... [id=iac-serverless/roles/vpcaccess.admin/serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com]
module.service_accounts.google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/iac-serverless/locations/global/workloadIdentityPools/prod-github-pool-v2/providers/prod-github-provider-v2]
module.service_accounts.google_service_account_iam_member.workload_identity: Refreshing state... [id=projects/iac-serverless/serviceAccounts/prod-terraform-sa@iac-serverless.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/992607210647/locations/global/workloadIdentityPools/prod-github-pool-v2/attribute.repository/marijastopa/gcp-serverless-infrastructure-iac]
module.networking.google_vpc_access_connector.connector: Refreshing state... [id=projects/iac-serverless/locations/europe-west1/connectors/iac-prod-vpc-connector]
module.networking.google_compute_router_nat.nat: Refreshing state... [id=iac-serverless/europe-west1/iac-prod-vpc-router/iac-prod-vpc-nat]
module.cloud_function.google_storage_bucket_object.function_zip: Refreshing state... [id=iac-serverless-function-deploy-prod-functions/iac-prod-function-14bc42f9a99c1a1e39d6f9bf9e27f951.zip]
module.app_storage.google_storage_bucket_iam_member.object_creator: Refreshing state... [id=b/iac-serverless-app-data-prod/roles/storage.objectCreator/serviceAccount:iac-prod-function-sa@iac-serverless.iam.gserviceaccount.com]
module.app_storage.google_storage_bucket_iam_member.object_viewer: Refreshing state... [id=b/iac-serverless-app-data-prod/roles/storage.objectViewer/serviceAccount:iac-prod-function-sa@iac-serverless.iam.gserviceaccount.com]
module.deployment_storage.google_storage_bucket_iam_member.object_creator: Refreshing state... [id=b/iac-serverless-function-deploy-prod/roles/storage.objectCreator/serviceAccount:iac-prod-function-sa@iac-serverless.iam.gserviceaccount.com]
module.deployment_storage.google_storage_bucket_iam_member.object_viewer: Refreshing state... [id=b/iac-serverless-function-deploy-prod/roles/storage.objectViewer/serviceAccount:iac-prod-function-sa@iac-serverless.iam.gserviceaccount.com]
module.secret_manager.google_secret_manager_secret_iam_member.accessor: Refreshing state... [id=projects/iac-serverless/secrets/iac-prod-app-secret/roles/secretmanager.secretAccessor/serviceAccount:iac-prod-function-sa@iac-serverless.iam.gserviceaccount.com]
module.cloud_function.google_cloudfunctions2_function.function: Refreshing state... [id=projects/iac-serverless/locations/europe-west1/functions/iac-prod-function]
module.load_balancer.google_cloud_run_service_iam_member.lb_invoker: Refreshing state... [id=v1/projects/iac-serverless/locations/europe-west1/services/iac-prod-function/roles/run.invoker/allUsers]
module.load_balancer.google_compute_region_network_endpoint_group.function_neg: Refreshing state... [id=projects/iac-serverless/regions/europe-west1/networkEndpointGroups/iac-prod-lb-neg]
module.load_balancer.google_compute_backend_service.function_backend: Refreshing state... [id=projects/iac-serverless/global/backendServices/iac-prod-lb-backend]
module.load_balancer.google_compute_url_map.url_map: Refreshing state... [id=projects/iac-serverless/global/urlMaps/iac-prod-lb-url-map]
module.load_balancer.google_compute_target_http_proxy.http_proxy: Refreshing state... [id=projects/iac-serverless/global/targetHttpProxies/iac-prod-lb-http-proxy]
module.load_balancer.google_compute_global_forwarding_rule.http: Refreshing state... [id=projects/iac-serverless/global/forwardingRules/iac-prod-lb-http-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloud_function.google_cloudfunctions2_function.function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "function" {
        id               = "projects/iac-serverless/locations/europe-west1/functions/iac-prod-function"
        name             = "iac-prod-function"
        # (11 unchanged attributes hidden)

      ~ service_config {
          ~ vpc_connector                    = "projects/iac-serverless/locations/europe-west1/connectors/iac-prod-vpc-connector" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.networking.google_vpc_access_connector.connector must be replaced
-/+ resource "google_vpc_access_connector" "connector" {
      ~ connected_projects = [
          - "iac-serverless",
        ] -> (known after apply)
      ~ id                 = "projects/iac-serverless/locations/europe-west1/connectors/iac-prod-vpc-connector" -> (known after apply)
      ~ max_throughput     = 1000 -> 300 # forces replacement
        name               = "iac-prod-vpc-connector"
      ~ network            = "iac-prod-vpc" -> (known after apply)
      ~ self_link          = "projects/iac-serverless/locations/europe-west1/connectors/iac-prod-vpc-connector" -> (known after apply)
      ~ state              = "READY" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ subnet {
            name       = "iac-prod-vpc-connector-europe-west1"
          ~ project_id = "iac-serverless" -> (known after apply)
        }
    }

  # module.service_accounts.google_project_iam_member.terraform_roles["roles/iam.workloadIdentityPoolAdmin"] will be created
  + resource "google_project_iam_member" "terraform_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:prod-terraform-sa@iac-serverless.iam.gserviceaccount.com"
      + project = "iac-serverless"
      + role    = "roles/iam.workloadIdentityPoolAdmin"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>